Revit 2024 API
ElectricalSetting Class
 The ElectricalSetting class represents an instance of element of electrical settings.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public class ElectricalSetting : Element
Visual Basic
Public Class ElectricalSetting _
	Inherits Element
Visual C++
public ref class ElectricalSetting : public Element
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Electrical.ElectricalSetting
See Also
ElectricalSetting Members
Autodesk.Revit.DB.Electrical Namespace